SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_wdog.h
/* Bit fields for WDOG CFG */
#define _WDOG_CFG_RESETVALUE                    0x000F0000UL                            /**< Default value for WDOG_CFG                  */
#define _WDOG_CFG_MASK                          0x730F073FUL                            /**< Mask for WDOG_CFG                           */
#define WDOG_CFG_CLRSRC                         (0x1UL << 0)                            /**< WDOG Clear Source                           */
#define _WDOG_CFG_CLRSRC_SHIFT                  0                                       /**< Shift value for WDOG_CLRSRC                 */
#define _WDOG_CFG_CLRSRC_MASK                   0x1UL                                   /**< Bit mask for WDOG_CLRSRC                    */
#define _WDOG_CFG_CLRSRC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_CLRSRC_SW                     0x00000000UL                            /**< Mode SW for WDOG_CFG                        */
#define _WDOG_CFG_CLRSRC_PRSSRC0                0x00000001UL                            /**< Mode PRSSRC0 for WDOG_CFG                   */
#define WDOG_CFG_CLRSRC_DEFAULT                 (_WDOG_CFG_CLRSRC_DEFAULT << 0)         /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_CLRSRC_SW                      (_WDOG_CFG_CLRSRC_SW << 0)              /**< Shifted mode SW for WDOG_CFG                */
#define WDOG_CFG_CLRSRC_PRSSRC0                 (_WDOG_CFG_CLRSRC_PRSSRC0 << 0)         /**< Shifted mode PRSSRC0 for WDOG_CFG           */
#define WDOG_CFG_EM1RUN                         (0x1UL << 1)                            /**< EM1 Run                                     */
#define _WDOG_CFG_EM1RUN_SHIFT                  1                                       /**< Shift value for WDOG_EM1RUN                 */
#define _WDOG_CFG_EM1RUN_MASK                   0x2UL                                   /**< Bit mask for WDOG_EM1RUN                    */
#define _WDOG_CFG_EM1RUN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_EM1RUN_DISABLE                0x00000000UL                            /**< Mode DISABLE for WDOG_CFG                   */
#define _WDOG_CFG_EM1RUN_ENABLE                 0x00000001UL                            /**< Mode ENABLE for WDOG_CFG                    */
#define WDOG_CFG_EM1RUN_DEFAULT                 (_WDOG_CFG_EM1RUN_DEFAULT << 1)         /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_EM1RUN_DISABLE                 (_WDOG_CFG_EM1RUN_DISABLE << 1)         /**< Shifted mode DISABLE for WDOG_CFG           */
#define WDOG_CFG_EM1RUN_ENABLE                  (_WDOG_CFG_EM1RUN_ENABLE << 1)          /**< Shifted mode ENABLE for WDOG_CFG            */
#define WDOG_CFG_EM2RUN                         (0x1UL << 2)                            /**< EM2 Run                                     */
#define _WDOG_CFG_EM2RUN_SHIFT                  2                                       /**< Shift value for WDOG_EM2RUN                 */
#define _WDOG_CFG_EM2RUN_MASK                   0x4UL                                   /**< Bit mask for WDOG_EM2RUN                    */
#define _WDOG_CFG_EM2RUN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_EM2RUN_DISABLE                0x00000000UL                            /**< Mode DISABLE for WDOG_CFG                   */
#define _WDOG_CFG_EM2RUN_ENABLE                 0x00000001UL                            /**< Mode ENABLE for WDOG_CFG                    */
#define WDOG_CFG_EM2RUN_DEFAULT                 (_WDOG_CFG_EM2RUN_DEFAULT << 2)         /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_EM2RUN_DISABLE                 (_WDOG_CFG_EM2RUN_DISABLE << 2)         /**< Shifted mode DISABLE for WDOG_CFG           */
#define WDOG_CFG_EM2RUN_ENABLE                  (_WDOG_CFG_EM2RUN_ENABLE << 2)          /**< Shifted mode ENABLE for WDOG_CFG            */
#define WDOG_CFG_EM3RUN                         (0x1UL << 3)                            /**< EM3 Run                                     */
#define _WDOG_CFG_EM3RUN_SHIFT                  3                                       /**< Shift value for WDOG_EM3RUN                 */
#define _WDOG_CFG_EM3RUN_MASK                   0x8UL                                   /**< Bit mask for WDOG_EM3RUN                    */
#define _WDOG_CFG_EM3RUN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_EM3RUN_DISABLE                0x00000000UL                            /**< Mode DISABLE for WDOG_CFG                   */
#define _WDOG_CFG_EM3RUN_ENABLE                 0x00000001UL                            /**< Mode ENABLE for WDOG_CFG                    */
#define WDOG_CFG_EM3RUN_DEFAULT                 (_WDOG_CFG_EM3RUN_DEFAULT << 3)         /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_EM3RUN_DISABLE                 (_WDOG_CFG_EM3RUN_DISABLE << 3)         /**< Shifted mode DISABLE for WDOG_CFG           */
#define WDOG_CFG_EM3RUN_ENABLE                  (_WDOG_CFG_EM3RUN_ENABLE << 3)          /**< Shifted mode ENABLE for WDOG_CFG            */
#define WDOG_CFG_EM4BLOCK                       (0x1UL << 4)                            /**< EM4 Block                                   */
#define _WDOG_CFG_EM4BLOCK_SHIFT                4                                       /**< Shift value for WDOG_EM4BLOCK               */
#define _WDOG_CFG_EM4BLOCK_MASK                 0x10UL                                  /**< Bit mask for WDOG_EM4BLOCK                  */
#define _WDOG_CFG_EM4BLOCK_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_EM4BLOCK_DISABLE              0x00000000UL                            /**< Mode DISABLE for WDOG_CFG                   */
#define _WDOG_CFG_EM4BLOCK_ENABLE               0x00000001UL                            /**< Mode ENABLE for WDOG_CFG                    */
#define WDOG_CFG_EM4BLOCK_DEFAULT               (_WDOG_CFG_EM4BLOCK_DEFAULT << 4)       /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_EM4BLOCK_DISABLE               (_WDOG_CFG_EM4BLOCK_DISABLE << 4)       /**< Shifted mode DISABLE for WDOG_CFG           */
#define WDOG_CFG_EM4BLOCK_ENABLE                (_WDOG_CFG_EM4BLOCK_ENABLE << 4)        /**< Shifted mode ENABLE for WDOG_CFG            */
#define WDOG_CFG_DEBUGRUN                       (0x1UL << 5)                            /**< Debug Mode Run                              */
#define _WDOG_CFG_DEBUGRUN_SHIFT                5                                       /**< Shift value for WDOG_DEBUGRUN               */
#define _WDOG_CFG_DEBUGRUN_MASK                 0x20UL                                  /**< Bit mask for WDOG_DEBUGRUN                  */
#define _WDOG_CFG_DEBUGRUN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_DEBUGRUN_DISABLE              0x00000000UL                            /**< Mode DISABLE for WDOG_CFG                   */
#define _WDOG_CFG_DEBUGRUN_ENABLE               0x00000001UL                            /**< Mode ENABLE for WDOG_CFG                    */
#define WDOG_CFG_DEBUGRUN_DEFAULT               (_WDOG_CFG_DEBUGRUN_DEFAULT << 5)       /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_DEBUGRUN_DISABLE               (_WDOG_CFG_DEBUGRUN_DISABLE << 5)       /**< Shifted mode DISABLE for WDOG_CFG           */
#define WDOG_CFG_DEBUGRUN_ENABLE                (_WDOG_CFG_DEBUGRUN_ENABLE << 5)        /**< Shifted mode ENABLE for WDOG_CFG            */
#define WDOG_CFG_WDOGRSTDIS                     (0x1UL << 8)                            /**< WDOG Reset Disable                          */
#define _WDOG_CFG_WDOGRSTDIS_SHIFT              8                                       /**< Shift value for WDOG_WDOGRSTDIS             */
#define _WDOG_CFG_WDOGRSTDIS_MASK               0x100UL                                 /**< Bit mask for WDOG_WDOGRSTDIS                */
#define _WDOG_CFG_WDOGRSTDIS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_WDOGRSTDIS_EN                 0x00000000UL                            /**< Mode EN for WDOG_CFG                        */
#define _WDOG_CFG_WDOGRSTDIS_DIS                0x00000001UL                            /**< Mode DIS for WDOG_CFG                       */
#define WDOG_CFG_WDOGRSTDIS_DEFAULT             (_WDOG_CFG_WDOGRSTDIS_DEFAULT << 8)     /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_WDOGRSTDIS_EN                  (_WDOG_CFG_WDOGRSTDIS_EN << 8)          /**< Shifted mode EN for WDOG_CFG                */
#define WDOG_CFG_WDOGRSTDIS_DIS                 (_WDOG_CFG_WDOGRSTDIS_DIS << 8)         /**< Shifted mode DIS for WDOG_CFG               */
#define WDOG_CFG_PRS0MISSRSTEN                  (0x1UL << 9)                            /**< PRS Src0 Missing Event WDOG Reset           */
#define _WDOG_CFG_PRS0MISSRSTEN_SHIFT           9                                       /**< Shift value for WDOG_PRS0MISSRSTEN          */
#define _WDOG_CFG_PRS0MISSRSTEN_MASK            0x200UL                                 /**< Bit mask for WDOG_PRS0MISSRSTEN             */
#define _WDOG_CFG_PRS0MISSRSTEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define WDOG_CFG_PRS0MISSRSTEN_DEFAULT          (_WDOG_CFG_PRS0MISSRSTEN_DEFAULT << 9)  /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_PRS1MISSRSTEN                  (0x1UL << 10)                           /**< PRS Src1 Missing Event WDOG Reset           */
#define _WDOG_CFG_PRS1MISSRSTEN_SHIFT           10                                      /**< Shift value for WDOG_PRS1MISSRSTEN          */
#define _WDOG_CFG_PRS1MISSRSTEN_MASK            0x400UL                                 /**< Bit mask for WDOG_PRS1MISSRSTEN             */
#define _WDOG_CFG_PRS1MISSRSTEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define WDOG_CFG_PRS1MISSRSTEN_DEFAULT          (_WDOG_CFG_PRS1MISSRSTEN_DEFAULT << 10) /**< Shifted mode DEFAULT for WDOG_CFG           */
#define _WDOG_CFG_PERSEL_SHIFT                  16                                      /**< Shift value for WDOG_PERSEL                 */
#define _WDOG_CFG_PERSEL_MASK                   0xF0000UL                               /**< Bit mask for WDOG_PERSEL                    */
#define _WDOG_CFG_PERSEL_DEFAULT                0x0000000FUL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_PERSEL_SEL0                   0x00000000UL                            /**< Mode SEL0 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL1                   0x00000001UL                            /**< Mode SEL1 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL2                   0x00000002UL                            /**< Mode SEL2 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL3                   0x00000003UL                            /**< Mode SEL3 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL4                   0x00000004UL                            /**< Mode SEL4 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL5                   0x00000005UL                            /**< Mode SEL5 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL6                   0x00000006UL                            /**< Mode SEL6 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL7                   0x00000007UL                            /**< Mode SEL7 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL8                   0x00000008UL                            /**< Mode SEL8 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL9                   0x00000009UL                            /**< Mode SEL9 for WDOG_CFG                      */
#define _WDOG_CFG_PERSEL_SEL10                  0x0000000AUL                            /**< Mode SEL10 for WDOG_CFG                     */
#define _WDOG_CFG_PERSEL_SEL11                  0x0000000BUL                            /**< Mode SEL11 for WDOG_CFG                     */
#define _WDOG_CFG_PERSEL_SEL12                  0x0000000CUL                            /**< Mode SEL12 for WDOG_CFG                     */
#define _WDOG_CFG_PERSEL_SEL13                  0x0000000DUL                            /**< Mode SEL13 for WDOG_CFG                     */
#define _WDOG_CFG_PERSEL_SEL14                  0x0000000EUL                            /**< Mode SEL14 for WDOG_CFG                     */
#define _WDOG_CFG_PERSEL_SEL15                  0x0000000FUL                            /**< Mode SEL15 for WDOG_CFG                     */
#define WDOG_CFG_PERSEL_DEFAULT                 (_WDOG_CFG_PERSEL_DEFAULT << 16)        /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_PERSEL_SEL0                    (_WDOG_CFG_PERSEL_SEL0 << 16)           /**< Shifted mode SEL0 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL1                    (_WDOG_CFG_PERSEL_SEL1 << 16)           /**< Shifted mode SEL1 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL2                    (_WDOG_CFG_PERSEL_SEL2 << 16)           /**< Shifted mode SEL2 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL3                    (_WDOG_CFG_PERSEL_SEL3 << 16)           /**< Shifted mode SEL3 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL4                    (_WDOG_CFG_PERSEL_SEL4 << 16)           /**< Shifted mode SEL4 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL5                    (_WDOG_CFG_PERSEL_SEL5 << 16)           /**< Shifted mode SEL5 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL6                    (_WDOG_CFG_PERSEL_SEL6 << 16)           /**< Shifted mode SEL6 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL7                    (_WDOG_CFG_PERSEL_SEL7 << 16)           /**< Shifted mode SEL7 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL8                    (_WDOG_CFG_PERSEL_SEL8 << 16)           /**< Shifted mode SEL8 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL9                    (_WDOG_CFG_PERSEL_SEL9 << 16)           /**< Shifted mode SEL9 for WDOG_CFG              */
#define WDOG_CFG_PERSEL_SEL10                   (_WDOG_CFG_PERSEL_SEL10 << 16)          /**< Shifted mode SEL10 for WDOG_CFG             */
#define WDOG_CFG_PERSEL_SEL11                   (_WDOG_CFG_PERSEL_SEL11 << 16)          /**< Shifted mode SEL11 for WDOG_CFG             */
#define WDOG_CFG_PERSEL_SEL12                   (_WDOG_CFG_PERSEL_SEL12 << 16)          /**< Shifted mode SEL12 for WDOG_CFG             */
#define WDOG_CFG_PERSEL_SEL13                   (_WDOG_CFG_PERSEL_SEL13 << 16)          /**< Shifted mode SEL13 for WDOG_CFG             */
#define WDOG_CFG_PERSEL_SEL14                   (_WDOG_CFG_PERSEL_SEL14 << 16)          /**< Shifted mode SEL14 for WDOG_CFG             */
#define WDOG_CFG_PERSEL_SEL15                   (_WDOG_CFG_PERSEL_SEL15 << 16)          /**< Shifted mode SEL15 for WDOG_CFG             */
#define _WDOG_CFG_WARNSEL_SHIFT                 24                                      /**< Shift value for WDOG_WARNSEL                */
#define _WDOG_CFG_WARNSEL_MASK                  0x3000000UL                             /**< Bit mask for WDOG_WARNSEL                   */
#define _WDOG_CFG_WARNSEL_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_WARNSEL_DIS                   0x00000000UL                            /**< Mode DIS for WDOG_CFG                       */
#define _WDOG_CFG_WARNSEL_SEL1                  0x00000001UL                            /**< Mode SEL1 for WDOG_CFG                      */
#define _WDOG_CFG_WARNSEL_SEL2                  0x00000002UL                            /**< Mode SEL2 for WDOG_CFG                      */
#define _WDOG_CFG_WARNSEL_SEL3                  0x00000003UL                            /**< Mode SEL3 for WDOG_CFG                      */
#define WDOG_CFG_WARNSEL_DEFAULT                (_WDOG_CFG_WARNSEL_DEFAULT << 24)       /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_WARNSEL_DIS                    (_WDOG_CFG_WARNSEL_DIS << 24)           /**< Shifted mode DIS for WDOG_CFG               */
#define WDOG_CFG_WARNSEL_SEL1                   (_WDOG_CFG_WARNSEL_SEL1 << 24)          /**< Shifted mode SEL1 for WDOG_CFG              */
#define WDOG_CFG_WARNSEL_SEL2                   (_WDOG_CFG_WARNSEL_SEL2 << 24)          /**< Shifted mode SEL2 for WDOG_CFG              */
#define WDOG_CFG_WARNSEL_SEL3                   (_WDOG_CFG_WARNSEL_SEL3 << 24)          /**< Shifted mode SEL3 for WDOG_CFG              */
#define _WDOG_CFG_WINSEL_SHIFT                  28                                      /**< Shift value for WDOG_WINSEL                 */
#define _WDOG_CFG_WINSEL_MASK                   0x70000000UL                            /**< Bit mask for WDOG_WINSEL                    */
#define _WDOG_CFG_WINSEL_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for WDOG_CFG                   */
#define _WDOG_CFG_WINSEL_DIS                    0x00000000UL                            /**< Mode DIS for WDOG_CFG                       */
#define _WDOG_CFG_WINSEL_SEL1                   0x00000001UL                            /**< Mode SEL1 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL2                   0x00000002UL                            /**< Mode SEL2 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL3                   0x00000003UL                            /**< Mode SEL3 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL4                   0x00000004UL                            /**< Mode SEL4 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL5                   0x00000005UL                            /**< Mode SEL5 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL6                   0x00000006UL                            /**< Mode SEL6 for WDOG_CFG                      */
#define _WDOG_CFG_WINSEL_SEL7                   0x00000007UL                            /**< Mode SEL7 for WDOG_CFG                      */
#define WDOG_CFG_WINSEL_DEFAULT                 (_WDOG_CFG_WINSEL_DEFAULT << 28)        /**< Shifted mode DEFAULT for WDOG_CFG           */
#define WDOG_CFG_WINSEL_DIS                     (_WDOG_CFG_WINSEL_DIS << 28)            /**< Shifted mode DIS for WDOG_CFG               */
#define WDOG_CFG_WINSEL_SEL1                    (_WDOG_CFG_WINSEL_SEL1 << 28)           /**< Shifted mode SEL1 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL2                    (_WDOG_CFG_WINSEL_SEL2 << 28)           /**< Shifted mode SEL2 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL3                    (_WDOG_CFG_WINSEL_SEL3 << 28)           /**< Shifted mode SEL3 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL4                    (_WDOG_CFG_WINSEL_SEL4 << 28)           /**< Shifted mode SEL4 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL5                    (_WDOG_CFG_WINSEL_SEL5 << 28)           /**< Shifted mode SEL5 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL6                    (_WDOG_CFG_WINSEL_SEL6 << 28)           /**< Shifted mode SEL6 for WDOG_CFG              */
#define WDOG_CFG_WINSEL_SEL7                    (_WDOG_CFG_WINSEL_SEL7 << 28)           /**< Shifted mode SEL7 for WDOG_CFG              */

